# *1.19. Дано целое четырехзначное число. Используя операции % и //, найти сумму его цифр.
x = int(input("введите четырёхзначное число x:"))
# a=x//1000 (1)
# b=x//100-a*10 (2)
# c=x//10-a*100-b*10 (3)
# d=x-a*1000-b*100-c*10 (4)
a1 = x // 1000
b1 = x // 100 - a1 * 10 
c1 = x // 10 - a1 * 100 - b1 * 10 
d1 = x - a1 * 1000 - b1 * 100 - c1 * 10 
y1 = a1 + b1 + c1 + d1

a = x % 1000
b = x // 100 % 10
c = x // 10 % 10
d = x % 10
y = a + b + c + d
print("сумма чисел числа", y1)
print("сумма чисел числа", y)