# 1.1. Даны два ненулевых числа. Найти их сумму, разность, произведение и частное.
# a = 32
# b = 52
# print("сумма чисел a и b =" + str(a+b))
# print("разность чисел aи b =" + str(a-b))
# print("произведение чисел aи b =" + str(a*b))
# print("частное чисел aи b =" + str(a/b))

a = int(input("введите значение а: "))
b = int(input("введите значение b: "))
# print("сумма чисел a и b =" + str(a + b))
# print("разность чисел a и b =" + str(a-b))
# print("произведение чисел a и b =" + str(a*b))
# print("частное чисел a и b =" + str(a/b))
print("сумма чисел a и b =" , a + b)